
    //기준점 (made by yumm)
    /*
    var 자소별기준점 = {
        ㄱ: [[p1, p2], [p2, p4]],
        ㄴ: [[p1, p2], [p2, p4]],
        ㄷ: [[p1, p2], [p2, p4]],
        ㄹ: [],
        ㅁ: [[p1, p2], [p2, p4], [p1, p3], [p3, p4]],
        ㅂ: [[p1, p3], [p3, p4], [p2, p4], [p5, p6]],
        ㅅ: [[p8, p7], [p7, p3], [p7, p4]],
        ㅇ: [[]],
        ㅈ: [[p1, p2], [p8, p7], [p7, p3], [p7, p4]],
        ㅊ: [[p12, p8], [p1, p2], [p8, p7], [p7, p3], [p7, p4]],
        ㅋ: [[p1, p2], [p5, p6], [p2, p4]],
        ㅌ: [[p1, p2], [p1, p3], [p5, p6], [p3, p4]],
        ㅍ: [[p1, p2], [p13, p15], [p14, p16], [p3, p4]],
        ㅎ: [[p9, p10], [p12, p11], [p7, p8]],

        얇은ㄱ: [[bp1, bp5], [bp5, bp17]],
        얇은ㄴ: [[bp1, bp13], [bp13, bp17]],
        얇은ㄷ: [[bp1, bp13], [bp5, bp17], [bp13, bp17], [bp9, bp11]],
        얇은ㄹ: [[bp1, bp5], [bp5, bp11], [bp9, bp11], [bp9, bp13], [bp13, bp17]],
        얇은ㅁ: [[bp1, bp5], [bp1, bp13], [bp13, bp17], [bp5, bp17]],
        
        얇은ㅂ: [[bp1, bp13], [bp5, bp17], [bp13, bp17], [bp9, bp11],],
        얇은ㅅ: [[bp3, bp10], [bp10, bp13], [bp10, bp17]],
        얇은ㅈ: [[bp1, bp5], [bp3, bp10], [bp10, bp13], [bp10, bp17]],
        얇은ㅌ: [[bp1, bp5], [bp1, bp13], [bp13, bp17], [bp9, bp11]],
        얇은ㅍ: [[bp1, bp5], [bp2, bp14], [bp4, bp16], [bp13, bp17]],
        얇은ㅎ: [[bp3, bp7], [bp6, bp8]],
        
        오: [[cp1, cp2], [cp6, cp3]],
        요: [[cp1, cp2], [cp8, cp4], [cp9, cp5]],
        우: [[cp1, cp2], [cp3, cp7]],
        유: [[cp1, cp2], [cp4, cp10], [cp5, cp11]],
        으: [[cp1, cp2]],
        
        아: [[dp1, dp10], [dp10, dp12], [dp12, dp2], [dp6, dp5]],
        야: [[dp1, dp10], [dp10, dp12], [dp12, dp2], [dp14, dp15], [dp17, dp18]],
        어: [[dp1, dp10], [dp10, dp12], [dp12, dp2], [dp7, dp5]],
        여: [[dp1, dp10], [dp10, dp12], [dp12, dp2], [dp14, dp16], [dp17, dp19]],
        이: [[dp1, dp10], [dp10, dp12], [dp12, dp2]],
        애: [[dp1, dp10], [dp10, dp12], [dp12, dp2], [dp6, dp5], [dp3, dp11], [dp11, dp13], [dp13, dp4]],
        얘: [[dp1, dp10], [dp10, dp12], [dp12, dp2], [dp14, dp15], [dp17, dp18], [dp3, dp11], [dp11, dp13], [dp13, dp4]],
        에: [[dp1, dp10], [dp10, dp12], [dp12, dp2], [dp7, dp5], [dp3, dp11], [dp11, dp13], [dp13, dp4]],
        예: [[dp1, dp10], [dp10, dp12], [dp12, dp2], [dp14, dp16], [dp17, dp19], [dp3, dp11], [dp11, dp13], [dp13, dp4]]
    };
    */
/*
        ㄱㅅ: [ ],
        ㄴㅈ: [],
        ㄴㅎ: [],
        ㄹㄱ: [],
        ㄹㅁ: [],
        ㄹㅂ: [],
        ㄹㅅ: [],
        ㄹㅌ: [],
        ㄹㅎ: [],
        ㅂㅅ: [],
        ㄲ: [],
        ㄸ: [],
        ㅆ: []

*/