class 한글 {
  static ㄱ() {
    직사각형(20, 20, 60, 20);
    직사각형(60, 20, 20, 60);
  }
  
  static ㄴ(){
    채우기(0);
    직사각형(20, 20, 20, 60);
    직사각형(20, 60, 60, 20);    
  }
  
  static ㄷ(){
    채우기(0);
    직사각형(20, 20, 60, 20);
    직사각형(20, 20, 20, 60);
    직사각형(20, 60, 60, 20);
  }
    
  static ㅇ(x, y){
    fill(255);
    ellipse(x, y, 100, 100);
    fill(0)
    ellipse(x, y, 50, 50);
  } 
  
  static ㅏ(){
    채우기(0);
    직사각형(40, 20, 20, 60);
    직사각형(40, 40, 30, 20);
  }
  
  static ㅓ(){
    채우기(0);
    직사각형(40, 20, 20, 60);
    직사각형(30, 40, 30, 20);    
  }
  
  static ㅣ(){
    채우기(0);
    직사각형(40, 20, 20, 60);
  }
}